<a href="https://colab.research.google.com/github/mademet/DAwPY/blob/main/pandas/pd_DataFrame.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [3]:
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
%matplotlib inline

In [5]:
data = [1, 3, 5, 7, 9]

In [7]:
df = pd.DataFrame(data,columns = ["cal1"])

In [8]:
df

   cal1
0     1
1     3
2     5
3     7
4     9

In [9]:
data2 = np.arange(1, 24, 2).reshape(3, 4)
data2

array([[ 1,  3,  5,  7],
       [ 9, 11, 13, 15],
       [17, 19, 21, 23]])

In [11]:
df2 = pd.DataFrame(data2, columns=["col1", "col2", "col3", "col4"] , index=["a", "b", "c"])
df2

   col1  col2  col3  col4
a     1     3     5     7
b     9    11    13    15
c    17    19    21    23

In [12]:
type(df2)

pandas.core.frame.DataFrame

In [13]:
df2.size

12

In [14]:
df2.shape

(3, 4)

In [15]:
df2.ndim

2

In [16]:
df2.col1

a     1
b     9
c    17
Name: col1, dtype: int64

In [17]:
df2["col1"]

a     1
b     9
c    17
Name: col1, dtype: int64

In [21]:
df2.index

Index(['a', 'b', 'c'], dtype='object')

In [25]:
df2.col1.a

1

In [26]:
s1 = np.random.randint(2,10, size = 40)
s2 = np.random.randint(30,100, size = 40)
s3 = np.random.randint(100,150, size = 40)

In [27]:
my_dict = {"var1": s1, "var2": s2, "var3": s3}

In [28]:
my_dict = pd.DataFrame(my_dict)

In [29]:
my_dictmb

    var1  var2  var3
0      9    68   110
1      2    92   113
2      9    89   135
3      6    74   148
4      5    74   108
5      3    62   129
6      3    44   120
7      6    33   102
8      4    97   123
9      6    94   118
10     5    46   109
11     9    43   142
12     9    49   149
13     4    85   123
14     4    45   149
15     8    66   139
16     7    56   105
17     8    59   101
18     8    97   122
19     2    50   116
20     2    56   129
21     6    85   128
22     3    64   115
23     7    75   105
24     4    61   102
25     6    75   114
26     9    31   130
27     3    43   101
28     8    89   146
29     3    72   142
30     6    63   120
31     9    67   108
32     9    57   123
33     7    51   131
34     6    40   104
35     6    47   137
36     2    86   138
37     7    71   111
38     7    33   123
39     2    32   105

In [32]:
df3 = my_dict[3:5]

In [34]:
df3.index = ["a", "b"]
df3.columns = ["x", "y", "z"]
df3

   x   y    z
a  6  74  148
b  5  74  108

In [35]:
np.random.seed(101)
np.random.randn(5,4)

array([[ 2.70684984,  0.62813271,  0.90796945,  0.50382575],
       [ 0.65111795, -0.31931804, -0.84807698,  0.60596535],
       [-2.01816824,  0.74012206,  0.52881349, -0.58900053],
       [ 0.18869531, -0.75887206, -0.93323722,  0.95505651],
       [ 0.19079432,  1.97875732,  2.60596728,  0.68350889]])

In [40]:
np.random.seed(101)
df3 = pd.DataFrame(  np.random.randn(5,4),
                   index = ['A', 'B', 'C', 'D', 'E'],
                   columns = 'W X Y Z'.split())
df3

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [42]:
df3["W"]

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [43]:
type(df3["W"])

pandas.core.series.Series

In [44]:
df3.W

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [45]:
df3[["W"]]

          W
A  2.706850
B  0.651118
C -2.018168
D  0.188695
E  0.190794

In [46]:
type(df3[["W"]])

pandas.core.frame.DataFrame

In [48]:
df3.loc[:,df3[["W"]"W":"Y"]

          W         X         Y
A  2.706850  0.628133  0.907969
B  0.651118 -0.319318 -0.848077
C -2.018168  0.740122  0.528813
D  0.188695 -0.758872 -0.933237
E  0.190794  1.978757  2.605967

In [52]:
df3

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [58]:
df3.loc["C"]

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

In [59]:
m=np.random.randint(1,40, size=(8,4))
df4 = pd.DataFrame(m, columns = ["var1","var2","var3",'var4'])
df4

   var1  var2  var3  var4
0     8    11    39    10
1    19     8    16     1
2    13    18    12    16
3    34    30    25    37
4    20    36    31    11
5    21    28     9    23
6    27    24    38    23
7    10     3    19    29

In [60]:
df4.index='a b c d e f g h'.split()
df4

   var1  var2  var3  var4
a     8    11    39    10
b    19     8    16     1
c    13    18    12    16
d    34    30    25    37
e    20    36    31    11
f    21    28     9    23
g    27    24    38    23
h    10     3    19    29

In [67]:
df4.loc['c':'f'][['var1','var3']]

   var1  var3
c    13    12
d    34    25
e    20    31
f    21     9

In [63]:
df4.loc["c":"f", "var1":"var3"]

   var1  var2  var3
c    13    18    12
d    34    30    25
e    20    36    31
f    21    28     9

In [68]:
df3

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [73]:
df3["X"] > 0

A     True
B    False
C     True
D    False
E     True
Name: X, dtype: bool

In [74]:
df3[df3["X"] > 0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
C -2.018168  0.740122  0.528813 -0.589001
E  0.190794  1.978757  2.605967  0.683509

In [76]:
df3[df3.X > 0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
C -2.018168  0.740122  0.528813 -0.589001
E  0.190794  1.978757  2.605967  0.683509

In [77]:
df3[df3.X > 0]["Z"]

A    0.503826
C   -0.589001
E    0.683509
Name: Z, dtype: float64